# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). 
# Выдать без повторений в порядке возрастания все те числа, которые встречаются 
# в обоих наборах.
# Пользователь вводит 2 числа. n - кол-во элементов первого множества. 
# m - кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.

# a = int(input("Введите количество элементов первого множества: "))
# b = int(input("Введите количество элементов второго множества: "))

# plenty_1 = set()
# plenty_2 = set()
# for i in range(a):
#     c = int(input("Введите значения элементов первого множества: "))
#     plenty_1.add(c)

# for i in range(b):
#     d = int(input("Введите значения элементов второго множества: "))
#     plenty_2.add(d)
# print(plenty_1)
# print(plenty_2)
# plenty_3 = plenty_1.union(plenty_2)
# print(plenty_3)
# print(sorted(plenty_3))

# mol = [int(x) for x in input().split()]
# n = mol[0]
# m = mol[1]
# set_1 = set()
# set_2 = set()
# list_1 = list()
# a = [int(x) for x in input().split()]
# k = set(a)
# for i in k:
# set_1.add(i)
# b = [int(x) for x in input().split()]
# k1 = set(b)
# for i in k1:
# set_2.add(i)
# lok = set_1 & set_2
# kool = list(lok)
# kool.sort()
# for i in kool:
# print(i, end=' ')


# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. 
# Она растет на круглой грядке, причем кусты высажены только по окружности. 
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет 
# N кустов. Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них 
# выросло различное число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники. 
# Эта система состоит из управляющего модуля и нескольких собирающих модулей. 
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, 
# собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может 
# собрать за один заход собирающий модуль, находясь перед некоторым кустом 
# заданной во входном файле грядки.

# n = int(input("Введите количество кустов: "))
# arr = list()
# for i in range(n):
#     x = int(input("Введите количество ягод на i-том кусте: "))
#     arr.append(x)

# berry_count = list()
# for i in range(len(arr) - 1):
#     berry_count.append(arr[i - 1] + arr[i] + arr[i + 1])
# berry_count.append(arr[-2] + arr[-1] + arr[0])
# print(f"максимальное число ягод {max(berry_count)}")

import random
bush = int(input("введите количество кустов: "))
berryes = list(random.randint(0, 10) for i in range(bush))
result = []
i = 0
count = 0

print(berryes)

while (i < bush):
    if (i == bush - 1):
        count = berryes[i] + berryes[i - 1] + berryes[0]
    else:
        count = berryes[i] + berryes[i - 1] + berryes[i + 1]
        result.append(count)
        result.sort()
    i += 1

print(f"максимальное число ягод за один заход: {result[-1]}")